export type Project = {
  id: string;
  city: string;
  capacity: number;
  fuel: string;
  design: { src: string; alt: string;};
  installed: { src: string; alt: string;};
  blurb?: string;
  challenges: string[];
};

const projects: Project[] = [
  {
    id: '1',
    city: 'Київ',
    capacity: 18,
    fuel: 'Електрика',
    design: {
      src: 'osokorky-design',
      alt: 'Проєкт котельні - котельня на електриці Київ, 2021',
    },
    installed: {
      src: 'osokorky-installed',
      alt: 'Змонтована котельня - котельня на електриці Київ, 2021',
    },
    challenges: [
      'Компактно розмістити котел, бойлер, фільтри',
      'Передбачити можливість встановлення теплоакумулятора в майбутньому',
    ],
  },
  {
    id: '2',
    city: 'Буча',
    capacity: 24,
    fuel: 'Електрика',
    design: {
      src: 'bucha-design',
      alt: 'Проєкт котельні - котельня під нічний тариф, Буча, Київська область, 2021',
    },
    installed: {
      src: 'bucha-installed',
      alt: 'Змонтована котельня - котельня під нічний тариф, Буча, Київська область, 2021',
    },
    challenges: [
      'Накопичення тепла по нічному тарифу для використання вдень',
      'Реконструкція котельні',
      'Дуже обмежений простір',
      'Деякі труби виходять прямо з підлоги "посеред кімнати"',
      'Стіна, на яку кріпиться обладнання ізольована ватою 100 мм',
    ],
  },
  {
    id: '3',
    city: 'Великий Крупіль',
    capacity: 18,
    fuel: 'Електрика, Дрова',
    design: {
      src: 'krupil-design',
      alt: 'Проєкт котельні - електричний котел, твердопаливний котел, теплоакумулятор, Великий Крупіль, 2023',
    },
    installed: {
      src: 'krupil-installed',
      alt: 'Змонтована котельня - електричний котел, твердопаливний котел, теплоакумулятор, Великий Крупіль, 2023',
    },
    challenges: [
      'Накопичення тепла по нічному тарифу для використання вдень',
      'Опалення дровами',
      'Можливість нагріва бойлера від твердопаливного котла',
    ],
  },
];

export default projects;
